[
  {
  "objectID": "T0001",
  "activityname": "Wild Wild Wet",
  "description": "Wild Wild Wet is one of Singapore’s largest water parks that promises a day of thrills and spills for the whole family. Situated in Downtown East, at the eastern part of Singapore, it remains one of the most popular tourist attractions! The impressively expanded park is now home to 16 attractions, with seven new additions such as Kraken Racer, Free Fall, and Kidz Zone, all of which promise to bring excitement to a whole new level for all!",
  "district": "East",
  "location": "Downtown East",
  "address": "1 Pasir Ris Close, S519599",
  "website": "https://www.wildwildwet.com/tickets-memberships/day-pass",
  "openinghours": "Wed-Mon, 12:00-18:00, Closed on Tuesday",
  "category": "Theme & Water Parks",
  "image":"https://www.helperfit.com/viewfile/group1/M01/04/4C/rB8nsF_NlX-AK8NzAAfxIiQp7gU670.jpg",
  "price":"⭐",
  "preferences": ["Adventure", "Family"]
  },
  {
    "objectID": "C0001",
  "activityname": "Singapore Cable Car",
  "description": "Take in impressive 360° aerial views of Singapore’s urban city, lush greenery of Mount Faber and Sentosa onboard the Singapore Cable Car. Have fun exploring Sentosa with Unlimited Rides and see the views evolve from day to night. To savor the magnificent views for even longer and delight in a unique dining experience, you can enjoy a set lunch at Mount Faber Peak Station or a dinner buffet at Good Old Days Restaurant within Sentosa.",
  "district": "South",
  "location": "Mount Faber",
  "address": "109 Mount Faber Road, S099203",
  "website": "https://www.klook.com/en-SG/activity/130-faber-peak-cable-car-singapore/?spm=Experiences_MFO.Activity_LIST&clickId=8862e8c9f9",
  "openinghours": "Mon-Sun, 08:45-22:00",
  "category": "Observation & Cable Cars",
  "image": "https://res.klook.com/images/fl_lossy.progressive,q_65/c_fill,w_1200,h_630/w_80,x_15,y_15,g_south_west,l_Klook_water_br_trans_yhcmh3/activities/30870e7d-Singapore-Cable-Car-Skypass/Singapore%20Cable%20Car%20Sky%20Pass.jpg",
  "price":"⭐",
  "preferences": ["Chill", "Family"]
  },
  {
  "objectID": "T0002",
  "activityname": "Universal Studio Singapore",
  "description": "Enter a world in Resorts World Sentosa where the worlds of blockbuster films and their iconic characters come to life! In this wonderful theme park, you and your companions can experience the thrills of cutting-edge rides, shows, and attractions based on movies and television shows like Puss In Boots’ Giant Journey, Battlestar Galactica: HUMAN vs. CYLON™, TRANSFORMERS The Ride: The Ultimate 3D Battle, Jurassic Park Rapids Adventure™, Sesame Street Spaghetti Space Chase and more!",
  "district": "South",
  "location": "Sentosa",
  "address": "8 Sentosa Gateway, Sentosa Island, S098269",
  "website": "https://www.rwsentosa.com/en/attractions/universal-studios-singapore/tickets",
  "openinghours": "Thurs-Sun, 12:00-19:00, Closed on Mon-Wed",
  "category": "Theme & Water Parks",
  "image":"https://www.amitravel.my/wp-content/uploads/2015/02/USS-BrandKV-1366x666-815x397.jpg",
  "price":"⭐⭐⭐",
  "preferences": ["Adventure", "Family"]
  },
  {
  "objectID": "T0003",
  "activityname": "Adventure Cove Waterpark Singapore",
  "description": "Located at Sentosa Island in Singapore, Southeast Asia’s first hydro-magnetic coaster isn’t its only claim to fame! Adventure Cove Waterpark offers 14 thrilling rides and attractions where you can enjoy to your heart’s content, from zooming down the high-speed water slides of Dueling Racer to drifting lazily down at Adventure River; snorkeling with amazing marine animals at Rainbow Reef to wading with friendly rays in the shallows at Ray Bay. Don’t miss to experience the shallow wading pool and playful fountain at Seahorse Hideaway, the open splash pool with twists and turns at Whirlpool Washout, and have a blast at Southeast Asia’s first hydro magnetic coaster at Riptide Rocket.",
  "district": "South",
  "location": "Sentosa",
  "address": "8 Sentosa Gateway, Sentosa Island, S098269",
  "website": "https://www.rwsentosa.com/en/attractions/adventure-cove-waterpark/tickets",
  "price":"⭐⭐",
  "openinghours": "Fri-Sun, 10:00-17:00, Closed on Mon-Thurs",
  "category": "Theme & Water Parks",
  "image":"https://www.rwsentosa.com/-/media/project/non-gaming/rwsentosa/attractions/adventure-cove-waterpark/adventure-cove-waterpark-pipeline-plunge-1366x666.jpg",
  "preferences": ["Adventure", "Family"]
  },
  {
  "objectID": "M0001",
  "activityname": "ArtScience Museum",
  "description": "Enter a world of wonder and discovery at Singapore’s ArtScience Museum at Marina Bay Sands! Since its opening in February 2011, the ArtScience Museum has become a must-visit destination for both locals and tourists alike thanks to its iconic lotus shape, its massive size of 6,000 square meters filled with 21 different gallery spaces, and fascinating exhibits! Catch unique exhibitions that are sure to quench any thirst for knowledge. Discover the FUTURE WORLD: Where Art Meets Science, a permanent exhibit popular among families with children. Adult guests will love it as well! See the 16 different digital installations inside this kid-friendly gallery and watch in awe as the interactive displays take you on a full immersion at ArtScience Museum!",
  "district": "Central",
  "location": "Marina Bay Sands",
  "address": "6 Bayfront Ave, S018974",
  "website": "https://art-science-museum.singapore-tickets.com/?gclid=CjwKCAjwi6WSBhA-EiwA6Niok0GbORoPTrdusqKcmnIit_RLDemaNXQLAFGjW-rRZB7g6RN7b_AS5xoCE5EQAvD_BwE",
  "price":"⭐",
  "openinghours": "Mon-Sun, 10:00-19:00",
  "category": "Museum & Galleries",
  "image": "https://www.visitsingapore.com/see-do-singapore/arts/museums-galleries/artscience-museum/_jcr_content/par-carousel/carousel_detailpage/carousel/item_2.thumbnail.carousel-img.740.416.jpg",
  "preferences": ["Chill", "Arts & Culture"]
  },
  {
  "objectID": "M0002",
  "activityname": "Science Centre",
  "description": "Make the most of your children’s school holidays or birthday party and take the whole family to Science Centre Singapore. The learning institution is considered one of the top science centres in the world. One of the must-see features of the Science Centre Singapore is the Singapore Omni Theatre, Singapore’s only dome-shaped, 5-story high theatre using the world’s latest & brightest 8K Digital Fulldome System. Butterfly lovers will also enjoy Butterflies Up-Close, the centre’s very own indoor butterfly sanctuary, which will give visitors a closer glimpse into the life cycle of these winged creatures. You can also observe various butterfly specimens and how a butterfly behaves in this live butterfly enclosure.",
  "district": "West",
  "location": "Jurong East",
  "address": "15 Science Centre Rd, S609081",
  "website": "https://www.science.edu.sg/buy-tickets",
  "price":"⭐",
  "openinghours": "Mon-Sun, 10:00-13:00, 14:00-17:00",
  "category": "Museum & Galleries",
  "image": "https://www.visitsingapore.com/see-do-singapore/recreation-leisure/fun-things-to-do/science-centre/_jcr_content/par-carousel/carousel_detailpage/carousel/item_2.thumbnail.carousel-img.740.416.jpg",
  "preferences": ["Chill", "Family", "Arts & Culture"]
  },
  {
  "objectID": "L0001",
  "activityname": "Gardens by the Bay",
  "description": "Gardens by the Bay is an iconic Singapore destination and is undoubtedly at the top of every visitor’s itinerary to the city. Its waterfront gardens (Bay South, Bay East, and Bay Central) and conservatories (the Flower Dome and Cloud Forest) as well as the newly opened Sun Pavilion, feature some of the most incredible man-made structures built to house flora and fauna from all over the world. Your Singapore Gardens by the Bay ticket gives you full access to the two conservatories and what’s more, you can even enter directly with your Klook voucher. Learn about the power interconnectedness of ecology, see the tallest indoor waterfall, and walk amid the Supertree Grove. With countless attractions for both grown-ups and children, Gardens by the Bay in Singapore will certainly ensure that you’ll have a day well-spent.",
  "district": "Central",
  "location": "Marina Bay",
  "address": "18 Marina Gardens Drive, S018953",
  "website":"https://ticket.gardensbythebay.com.sg/product/listing",
  "price":"⭐",
  "openinghours": "Mon-Sun, 10:00-20:00",
  "category": "Natural Landscape & Gardens",
  "image": "https://grant-associates.uk.com/imager/projects/Gardens-by-the-Bay/18560/SNG233_N814-crop_b4d32de2edd68d7354c2bc997fd72d27.jpg",
  "preferences": ["Chill", "Nature"]
  },
  {
  "objectID": "A0001",
  "activityname": "S.E.A Aquarium",
  "description": "Venture through the fascinating world beneath the sea as you explore the ocean realm of S.E.A. Aquarium Singapore, home to more than 100,000 marine animals of over 800 species across 49 different habitats, each one as fascinating as the next. Get acquainted with marine habitat as you meet magnificent hammerhead sharks and come face-to-face with bottlenose dolphins. As South East Asia's largest aquarium, an awe-inspiring experience awaits as you unfold the endless wonders of our blue planet. ",
  "district": "South",
  "location": "Sentosa",
  "address": "8 Sentosa Gateway, Sentosa Island, S098269",
  "website": "https://www.rwsentosa.com/en/attractions/sea-aquarium/tickets",
  "price":"⭐⭐",
  "openinghours": "Sat-Tues, 10:00-17:00",
  "category": "Aquariums, zoos & farms",
  "image": "https://www.rwsentosa.com/-/media/project/non-gaming/rwsentosa/articles/attractions/insider-guide-to-seaa/insider-guide-to-exploring-sea-aquarium.jpg",
  "preferences": ["Animals", "Family", "Adventure", "Nature"]
  },
  {
  "objectID": "A0002",
  "activityname": "Singapore Zoo",
  "description": "Set in one of the most beautiful wildlife environments in the world, Singapore Zoo is home to over 2,800 animals from over 300 species of mammals, birds and reptiles that roam freely in open enclosures resembling their natural habitats, separated from visitors only by moats and wooden fencing. The park also boasts the world's first free-ranging orangutan habitat in a zoo! Spend a day exploring this award winning zoo - a great family activity in Singapore. ",
  "district": "West",
  "location": "Mandai",
  "address": "80 Mandai Lake Road, S729826",
  "website": "https://www.mandai.com/en/ticketing/admission-and-rides/parks-selection.html",
  "price":"⭐⭐",
  "openinghours": "Mon-Sun, 08:30-18:00",
  "category": "Aquariums, zoos & farms",
  "image": "https://www.makemytrip.com/travel-guide/media/dg_image/singapore/Sinagapore-zoo_0.jpg",
  "preferences": ["Animals", "Family", "Nature"]
  },
  {
  "objectID": "P0001",
  "activityname": "Sentosa Luge: Skyline Luge & Skyride",
  "description": "Part-go kart, part-toboggan, a trip to Skyline Luge will have you racing down a purpose-built track with the wind in your hair and the thrill of gravity's pull. Originating from New Zealand over 27 years ago, Skyline Luge allows guests to hop on a three-wheel type sled and have them control their descent down the 1.2m track by pulling or pushing handlebars to brake or accelerate. After you arrive down the track, you can head back up onboard the scenic Sentosa Skyride - an open-cabin trip with bird's eye views of Sentosa! Don’t miss out on the chance to experience the only place in all of Asia that has the Skyline Luge when you visit Singapore!",
  "district": "South",
  "location": "Sentosa",
  "address": "45 Siloso Beach Walk, Sentosa, S098269",
  "website": "https://www.skylineluge.com/en/sentosa/buy-tickets/",
  "price":"⭐⭐⭐",
  "openinghours": "Mon-Sun, 11:00-19:30",
  "category": "Attraction Passes",
  "image": "https://res.klook.com/images/fl_lossy.progressive,q_65/c_fill,w_1295,h_720/w_80,x_15,y_15,g_south_west,l_Klook_water_br_trans_yhcmh3/activities/ad6eb88c-Skyline-Luge/SentosaLugeTicket:SkylineLugeSkyride.webp",
  "preferences": ["Adventure", "Family"]
  },



  {
    "objectID": "T0004",
    "activityname": "Snow City",
    "description": "Go in for the ultimate cooldown in Snow City Singapore. Try snowtubing and making snow angels in the tropics! Enjoy loads of winter fun in the center of the tropical city: play snowballs, see ice sculptures, visit an igloo and more!",
    "district": "West",
    "location": "Jurong",
    "address": "21 Jurong Town Hall Rd, S609433",
    "website": "https://ticket.snowcity.com.sg/",
    "price":"⭐",
    "openinghours": "Tues-Fri, 10:00-17:00 (Last Admission: 16:00), Weekends, Schools and Public Holidays, 10:00-18:00 (Last Admission: 17:00)",
    "category": "Theme & Water Parks",
    "image": "https://res.klook.com/image/upload/c_fill,w_960,h_460,f_auto/w_80,x_15,y_15,g_south_west,l_Klook_water_br_trans_yhcmh3/activities/ycnuoio5y6jj3zixztci.webp",
    "actID": "#/T0004",
    "preferences": ["Family", "Adventure"]
  },
  {
    "objectID": "T0005",
    "activityname": "HydroDash",
    "description": "Experience a fun water adventure at the first floating aqua park in Singapore, right in the heart of Sentosa. Spend the day at HydroDash Singapore and enjoy the family-friendly inflatable water park. Dash through four thrill-seeking floating obstacle courses that caters to all ages!",
    "district": "South",
    "location": "Sentosa",
    "address": "72 Palawan Beach Walk, Sentosa, S099344",
    "website": "https://www.hydrodash.com.sg/ticket-prices/",
    "price":"⭐",
    "openinghours": "Weekdays: 12pm – 6pm, Weekends and Public Holidays and School Holidays: 10am – 7pm",
    "category": "Theme & Water Parks",
    "image": "https://res.klook.com/image/upload/c_fill,w_960,h_460,f_auto/w_80,x_15,y_15,g_south_west,l_Klook_water_br_trans_yhcmh3/activities/ggxljceqcv0iuolfi5z8.webp",
    "actID": "#/T0005",
    "preferences": ["Family", "Adventure"]
  },
{
  "objectID": "M0003",
  "activityname": "Madame Tussauds Singapore",
  "description": "Feel the action at our brand new Marvel Universe 4D experience and getting your instagram moments with your favourite super heroes – Iron Man and Spiderman. Can’t decide between Bollywood or Hollywood? We have both! Go on an audition to be the next Bollywood superstar or get up close and personal with all the famous people at our various zones – Music, A-List Party, Sports, History & Leaders, Film and more. Next, take a trip back down the memory lane and discover Singapore’s transformation from a small village into a bustling metropolis. Don't leave without hopping aboard The Spirit of Singapore Boat Ride that takes you on a voyage through an exotic tropical garden.",
  "district": "South",
  "location": "Sentosa",
  "address": "40 Imbiah Rd, Sentosa, S099700",
  "website": "https://www.madametussauds.com/singapore/tickets/",
  "price":"⭐⭐",
  "openinghours": "Thursday-Monday: 10:00-18:00",
  "category": "Museum & Galleries",
  "image": "https://res.klook.com/images/fl_lossy.progressive,q_65/c_fill,w_1295,h_1942/w_80,x_15,y_15,g_south_west,l_Klook_water_br_trans_yhcmh3/activities/xda5osqtvrywuz8wofgn/MadameTussaudsSingaporeTicket.webp",
  "actID": "#/M0003",
  "preferences": ["Family", "Arts & Culture"]
  },
{
  "objectID": "M0004",
  "activityname": "Trick Eye Museum",
  "description": "Let your imagination run wild at Trick Eye Museum in Singapore, an internationally-renowned 3D art museum from Korea. With its huge array of hand-painted art exhibits made by dedicated Korean artists, each exhibit comes alive with the use of a special art technique, called Trompe-l’oeil, that makes 2D art pop up into 3D! Feel, touch, and interact with the exhibits in 6 different zones, and enjoy a day filled with fun, laughter, adventure and excitement. Get a heightened experience of the Trick Eye Museum with their very own Augmented Reality mobile app, where you'll see a whole new world of AR appear before your very eyes! Discover a hidden word that is seen only through the app by downloading the free “Trickeye-Singapore” mobile app from the Google Play Store or App Store, and watch as your photos and videos come alive with hidden animals, magic, fireworks and other special effects! Come experience our latest exhibits all the way from Korea! Do battle with a ferocious sea dragon, take a walk on the wild side among giant dinosaurs or try to escape the clutches of the evil witch if you’re up for an adventure. Or stroll through the colourful Rainbow Room with larger than life candy if you’re looking for Insta-worthy photos. Challenge yourself to take the most creative optical illusion photos, and enjoy a day filled with laughter, fun and memories.",
  "district": "South",
  "location": "Sentosa",
  "address": "Block B 80 Siloso Road #01-04, S098969",
  "website": "https://trickeye.com/singapore/Ticket",
  "price":"⭐",
  "openinghours": "Thursday - Monday: 11:00 - 19:00",
  "category": "Museum & Galleries",
  "image": "https://res.klook.com/image/upload/u_activities:rv7mblrml39rc0g50cvz,h_1.0,ar_1160:460,c_scale,e_blur:10000/c_fill,w_960,h_460,f_auto/w_80,x_15,y_15,g_south_west,l_Klook_water_br_trans_yhcmh3/activities/rv7mblrml39rc0g50cvz.webp",
   "actID": "#/M0004",
   "preferences": ["Family", "Arts & Culture"]
},
{
  "objectID": "M0005",
  "activityname": "National Gallery",
  "description": "Explore Southeast Asian art at the new National Gallery Singapore. After opening its doors on 24 Nov 2015, the gallery is located in Singapore's Civic District and boasts a combined floor area of 64,000 square meters and is housed in two of the island's most iconic buildings: former Supreme Court and City Hall. National Gallery Singapore is the largest visual arts venue and museum in Singapore – home to over 1,000 art works and it is certainly one of the main attractions in Singapore. Visitors are introduced to Singaporean and Southeast Asian art in the long-term and special exhibitions taking place at the gallery. A visit to the National Gallery Singapore is a great opportunity to discover art, culture and architecture of Singapore.",
  "district": "Central",
  "location": "Raffles Place",
  "address": "1 St. Andrew's Rd Singapore, S178957",
  "website": "https://www.nationalgallery.sg/admissions",
  "price":"⭐",
  "openinghours": "Mon-Sun, 10:00-19:00",
  "category": "Museum & Galleries",
  "image": "https://res.klook.com/image/upload/c_fill,w_960,h_460,f_auto/w_80,x_15,y_15,g_south_west,l_Klook_water_br_trans_yhcmh3/activities/50c6d087-%E6%96%B0%E5%8A%A0%E5%9D%A1%E5%9B%BD%E5%AE%B6%E7%BE%8E%E6%9C%AF%E9%A6%86---Klook%E5%AE%A2%E8%B7%AF.webp",
  "actID": "#/M0005",
  "preferences": ["Family", "Arts & Culture"]
   },
{
  "objectID": "M0006",
  "activityname": "National Museum",
  "description": "Explore the National Museum of Singapore – home to numerous historical artifacts and exhibits. Dating back to 1887, the National Museum of Singapore is the country's oldest museum and a cultural and architectural landmark. Despite its rich historical background, the museum's galleries have adopted the latest cutting edge display techniques that redefine the traditional museum experience. From humble beginnings to the present day metropolis, you'll learn about everything from daily life to the rapid development of this island nation over 700 years of Singapore history. The National Museum of Singapore hosts a variety of exhibitions, festivals, film screenings, and thought-provoking performances all year round – so you are sure to witness a truly great event during your visit.",
  "district": "Central",
  "location": "City Hall",
  "address": "93 Stamford Road, S178897",
  "website": "https://www.klook.com/en-SG/activity/1199-national-museum-singapore/",
  "price":"⭐",
  "openinghours": "Mon-Sun, 10:00-19:00",
  "category": "Museum & Galleries",
  "image": "https://res.klook.com/image/upload/c_fill,w_960,h_460,f_auto/w_80,x_15,y_15,g_south_west,l_Klook_water_br_trans_yhcmh3/activities/16da1148-National-Museum-of-Singapore.webp",
  "actID": "#/M0006",
  "preferences": ["Family", "Arts & Culture"]
  },
{
  "objectID": "C0002",
  "activityname": "Skyhelix Sentosa",
  "description": "Located at Imbiah Lookout, SkyHelix Sentosa is the highest open-air panoramic ride in Singapore that reveals breathtaking views as it gently rotates 35 meters above ground along with a vertical helix-like structure. Guests will enjoy unparalleled 360° sights of Sentosa and the developing Greater Southern Waterfront while dangling their feet in the air with a cool drink in hand. The ride’s apex is 79 meters above sea level, making it one of the highest vantage points on Sentosa.",
  "district": "South",
  "location": "Sentosa",
  "address": "41 Imbiah Road, S099707",
  "website": "https://skyhelixsentosa.singapore-tickets.com/?gclid=CjwKCAjwi6WSBhA-EiwA6Niok-CASlnONFr76skn2xLrORtN3BksX553ZlzMbNi8ZJQxkliZst53nRoCzIQQAvD_BwE",
  "price":"⭐",
  "openinghours": "Mon-Sun, 10:00-21:30",
  "category": "Observation & Cable Cars",
  "image": "https://res.klook.com/image/upload/u_activities:bwz7xgchgzngimm7bjeu,h_1.0,ar_1160:460,c_scale,e_blur:10000/c_fill,w_960,h_460,f_auto/w_80,x_15,y_15,g_south_west,l_Klook_water_br_trans_yhcmh3/activities/bwz7xgchgzngimm7bjeu.webp",
  "actID": "#/C0002",
  "preferences": ["Family", "Adventure"]
  },
{
  "objectID": "A0003",
  "activityname": "Jurong Bird Park",
  "description": "Meet and interact with thousands of birds at Asia's largest bird paradise. Discover a collection of over 5,000 colorful birds from 400 species, across over 20.2 hectares of exploratory landscapes, naturalistic environments and giant walk-in aviaries. Prepare to be amazed by the Waterfall Aviary that houses one of the world's tallest man-made, indoor waterfalls towering at a height of 35m (equivalent to 13 storeys).",
  "district": "West",
  "location": "Jurong",
  "address": "2 Jurong Hill, S628925",
  "website": "https://www.kkday.com/en-sg/product/2967-jurong-bird-park-ticket-singapore?cid=2636&ud1=sg&ud2=2967&utm_source=search&utm_medium=paid&utm_campaign=2967&gclid=CjwKCAjwi6WSBhA-EiwA6NiokyQwkXeBEe2uBRzb9khGN6KYoOPyF_R_kRrYsfN-_dRCru_NDzQpURoCWgkQAvD_BwE",
  "price":"⭐⭐",
  "openinghours": "Thurs-Sun, 08:30-18:00",
  "category": "Aquariums, zoos & farms",
  "image": "https://res.klook.com/images/fl_lossy.progressive,q_65/c_fill,w_1200,h_630,f_auto/w_80,x_15,y_15,g_south_west,l_klook_water/activities/oaia1awvnvm6jehazlqy/Jurong%20Bird%20Park%20Admission%20Ticket.jpg",
  "actID": "#/A0003",
  "preferences": ["Family", "Animals", "Nature"]
  },
{
  "objectID": "A0004",
  "activityname": "Night Safari",
  "description": "As dusk falls, take an after-hours look at over 2,500 nocturnal animals starting their nightly rituals with an adventure to the Singapore Night Safari. Managed by the Wildlife Reserves Singapore Group, Night Safari is one of the many exciting zoos you can visit in the city other than the Singapore Zoo, River Wonders, and Jurong Bird Park. When in the Night Safari come close as the fascinating animals frolic, graze and hunt throughout the night. Embark on exciting tram rides that take you through 7 geographical regions of a wide range of animals. The guided tour brings along an expert guide to answer all your questions about the animals you’ll see during the tram ride. Visitors can opt to also explore the walking trails for an even deeper journey into the park. Follow the exciting paths of the Fishing Cat Trail, Leopard Trail, East Lodge Trail, and Wallaby Trail to meet the animals that come alive at night. Don't miss out the interactive Creatures of the Night Show, where you can learn more about the natural abilities of fascinating nocturnal animals during the show!",
  "district": "West",
  "location": "Mandai",
  "address": "80 Mandai Lake Road, S729826",
  "website": "https://www.mandai.com/en/night-safari/visit.html",
  "price":"⭐⭐",
  "openinghours": "Thurs-Sun, 18:30-00:00",
  "category": "Aquariums, zoos & farms",
  "image": "https://media.tacdn.com/media/attractions-splice-spp-674x446/06/75/89/b2.jpg",
  "actID": "#/A0004",
  "preferences": ["Family", "Animals", "Nature"]
  },
{
  "objectID": "P0002",
  "activityname": "Sentosa Fun Pass",
  "description": "Have you ever wondered what endless fun looks like? Take a look at the Sentosa FUN Pass––your ticket to The State of Fun! Explore Sentosa, Singapore's famous island resort and the abundance of activities it has to offer. Loads of alluring attractions await you: from 4D Adventureland to Headrock VR and S.E.A Aquarium, you surely won’t be strapped for your choice of fun. Spend a carefree day with your family and friends and save money as you do it. The Sentosa Token FUN Pass (90+5, 120+10 tokens) is your gateway into the land of adventures, and at an affordable price!",
  "district": "South",
  "location": "Sentosa",
  "address": "8 Sentosa Gateway, Sentosa Island, S098269",
  "website": "https://www.sentosa.com.sg/en/deals/promos/sentosa-fun-pass/",
  "price":"⭐⭐⭐",
  "openinghours": "Mon-Sun, 09:00-20:00",
  "category": "Attraction Passes",
  "image": "https://res.klook.com/image/upload/fl_lossy.progressive,q_65,f_auto/c_fill,w_570,h_320/v1515552485/activities/xeqoblkac487jwf6jexk.webp",
  "actID": "#/P0002",
  "preferences": ["Family", "Adventure"]
  }
]